package exam_class_basic;

// 성적을 구현하는 Score 클래스를 정의하자.
/* [필드 구현] 이름/국어/영어/수학/총점을 저장하고자 한다.
 * [메서드 구현] 필드에 값을 설정할 수 있는 기능, 점수들의 합을 구하는 기능, 평균을 구하는 기능,
 *             학점을 구하는 기능, 모든 필드를 출력할 수 있는 기능을 포함하도록 한다.
 * [출력 결과] 사용자로 하여금 이름 및 점수들을 입력받아 아래의 결과를 출력하도록 한다.
 * ====================
 * 이름  국어  영어  수학
 * ====================
 * 홍길동 90   75   61
 * 홍길동 90   75   61
 * 홍길동 90   75   61
 *
 * 그 후 총점과 평균과 학점을 출력하도록 코드를 수정한다
 * ===================================
 * 이름  국어  영어  수학  총점  평균  학점
 * ===================================
 * 홍길동 90   75   61   226   75.3  C
 * 홍길동 90   75   61
 * 홍길동 90   75   61
 */
class Score {
}

public class ScoreTest {

}